# SQL Syntax

## Basic 

**0.clear page:**

        system clear;

**1.connect to mysql**

        /usr/local/mysql/bin/mysql -u root -p

**2.see all the databases:**

        show databases;
        
        ##########################################################
        show databases;-->show all the databases
        use databases;-->use single database
        show tables;-->show all the tables in that single database
        disc tablename;-->show the column name of specific table
        ##########################################################
        
**3.use database:**

        use DatabaseName;
        
**4.see all the tables under specific database:**

        show tables;
        
**5.create table:**
 
        create table TableName( columnname1 int primary key, columnname2 varchar(100) not null, columnname3 int);

**6.insert values:**

       insert into TableName values(25, 'Aman', 'Bengaluru', 32569);
       or
       insert into TableName(columnname1,columnname3) values( value1,value3);

**7.see content:**

       describe TableName;#--->see table content
       describe ColumnName;#--->see column content
       

**8.select all the columns from a table:**

       select* from TableName;
       
**9.update table:**
       
       9.1 add:
       alter table TableName add(Address varchar(100));
       alter table TableName add(Email_ID varchar(100), Contact_no varchar(100));
       alter table TableName add(test int default 100);
       
       9.2 modify:
           9.2.1 change data type
              alter table TableName modify Contact_no int;
           9.2.2 rename a column
              alter table TableName change Address Location varchar(100); #change column name address to location
           9.2.3 delete column
              alter table TableName drop column Test;
              alter table TableName drop column Email_ID,drop column Contact_no;

**10.retrive data**

    10.1 select all:
       select * from TableName;
    10.2 select one column:
       select columnname from TableName;
    10.3 select multiple column:
       select columnname1,columnname2 from TableName; #table followt your selection order
       
    10.4 retrive data from outer source:
       source'file_name.sql'
       like:source Desktop/mysqlsampledatabase.sql;
    
**11.restrict result set:**

    11.1 limit
          selec ColumnName from TableName limit 20;    
    11.2 distinct
          selec distinct ColumnName from TableName

**12.filter result:**
  
    select* from orders where atatus = 'In Process';
    select* from orders where ordernumber > 100 and ordernumber < 120;
    select* from orders where comments is not Null;
    select* from orders where comments is Null limit 10;

**13.aggregate functions:perform a calculation on a set of values and return a single value**

    different functions:
               count:count(*)
                     count(column_name)
                     count(distinc column_name)
               avg
               max
               min
               sum
    
    13.1 count
         select count(*) from student;#-->return the number of records(4)
         select count(age) from student;#-->return not null records(2)
         select count(distinc age) from student;#-->return not null and distinct records(1)
         select count(*) from student where age is not null;
         
    13.2 avg
         select avg(columnname) from tablename where amount>2000;
         
    13.3 min & max & sum
         select min(columnname) from tablename;
         select max(columnname) from tablename;
         select sum(columnname) from tablename;

**14.Update and delete**

    14.1 update:
         update faculty set salary=5000;#update all the salary 5000
         update faculty set salary=5000 where Faculty_id=101;
    14.2 delete:
         delete from faculty;#-->delete all the content
         delete from faculty where salary=1000;
    14.3 truncate:delete all the table content
         truncate faculty;
    14.4 drop:delete table completely
         drop table falculty;
         drop databases school;

## Advance

**1. group by**
 
     select country, count(*) from customers group by country; 
     select country, state,count(*) from customers group by country,state;

**2. having**

    group by can not be used with where+functions like where age>50, but having can do this;
    wrong: select state,count(*) from customers where count(*)>5 group by state;
    right: select state,count(*) from customers group by state having count(*)>5 desc;

**3.IN / NOT IN**

    the IN operator is a shorthand for multiple OR conditions
    the IN operator allows you to determine if a specified value matches anyvalue from a list or from a subquery
    syntax:select column1...from tablename where (expr/columns) in ("value1","value2"..)must seperate with','
           select column1...from tablename where (expr/columns) not in ("value1","value2"..)must seperate with','

**4.order by**

    select productname,productline from products where producline in ('motocycle','classic cars') and quantityin stock>500 order by quantityin stock;

**5.between**

    5.1 can use between clause to replace a combination of"greater than equal" and "lessthan equal"conditions
    5.2 syntax: select columnname from tablename where columnname between value1 and value2;
    5.3 it will return the records with in the range of value1 and value2(inclusive)
    5.4 values can be numbers, text and dates
    
    select productname, productline from products where quantityinstock between 500 and 700;
    select productname, productline from products where quantityinstock not between 500 and 700;

**6.like**

     6.1 like operator is used in a where clause to search for a specific pattern in a column
     6.2 there are two wildcards used in conjunction with the like operator:
         6.2.2 %:the percent sign represents zero, one, or multiple characters
         6.2.3 _: the underscore represent a single character
     6.3 syntax: select column..from tablename where column like pattern
     6.4 pattern:
         like's%':any value starts with"s"
         like'%s%':any value which have "s" in any position
         like'_ss%':any value which the second and third postion is "s"
         like's_%_%:any value starts with s and have at least 3 characters in length
         like'%s':any value ends with 's'
         like"_s%p":'s'in the second position and end with'p'
         like"s___p":any value with 5 digits and start with 's' and end with 'p'
         
     example:select customername from products where customername like "c%";
             select customername from products where customername like "c%co.";#start with c and end with co.
             
     6.5 if you want % to refer the real % you need to add \ before %
     example:select customername from products where customername like "%\%%"; #--> cb%df

**7.join**

    7.1 types of joins:
        1)inner join or simple join
        2)left outer join or left join
        3)right outer join or right join
        4)full outer join or full join
    
    7.2 inner join: return the common parts
        syntax: select table1.col1,table2.col2.. from table1 inner join table2 on table1.colname=table2.colname;
        example: select * from t1 inner join t2 on t1.name=t2.id where t1.id>=2;
             if the col is unique no need to write t1. or t2.
             
    7.3 inner join with 3 tables:
        syntax: select table1.col1,table2.col2.. 
                from table1 
                inner join table2 
                on table1.colname=table2.colname
                inner join table3 
                on table2.colname=table3.colname
    7.4 left & right join:
        left join:left all and right common
                select table1.col1,table2.col2.. from table1 left join table2 on table1.colname=table2.colname;
        right join:right all and left common
                select table1.col1,table2.col2.. from table1 right join table2 on table1.colname=table2.colname;

**8.indexing**
    
    Advantage: faster when search
    Disadvantage: lower when insert or delete

    8.1 in more formal terms,indexes in database is a kind of data structure that improves the speed of operation  
        in a table
    
    8.2 in mysql, default index are done based on primary key,if table doesn't have primary key-->no index
    
    8.3 primary key/unique/mul
        primary key-->unique+not null
    
    8.4 default key-->primary key-->cluster indexing
                   -->unique key-->non-cluster indexing
                   
    8.5 see all indexes defined for a table:
        8.5.1 show index from tablename from databasename
        8.5.2 show index from databasename.tablename 
        
        
    8.6 use default indexing:
        explain select primary/unique/mul key columns from tablename;#--> only a few rows have been scaned-->faster
        explain select non primary/unique/mul key columns from tablename;#--> all the rows have been scaned
        
    8.7 add & remove indexes
        8.7.1 add  1)directly add:
                   syntax: create index indexname on tablename (colname);
                   example: create index index_postalcode on customers (postalcode);#-->column already exsted
                   2)add when create table:
                   example: create table test(id int primary key, name varchar(100), index name_index(name));
                   
        8.7.2 drop syntax: drop index indexname on tablename:
                   example: drop index index_postalcode on customers;